[Killed] BlockStatement
index.js:3:30
 function calcularResultado(nota1, nota2) {
   // Função para validar se as notas são números entre 0 e 10
-  function validarNota(nota) {
-    return typeof nota === 'number' && nota >= 0 && nota <= 10;
-  }
+  function validarNota(nota) {}
 
   // Validação das notas de entrada
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Erro: Nota1 inválida. Insira um número entre 0 e 10."

[Killed] EqualityOperator
index.js:4:40
 function calcularResultado(nota1, nota2) {
   // Função para validar se as notas são números entre 0 e 10
   function validarNota(nota) {
-    return typeof nota === 'number' && nota >= 0 && nota <= 10;
+    return typeof nota === 'number' && nota < 0 && nota <= 10;
   }
 
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Erro: Nota1 inválida. Insira um número entre 0 e 10."

[Killed] ConditionalExpression
index.js:4:53
 function calcularResultado(nota1, nota2) {
   // Função para validar se as notas são números entre 0 e 10
   function validarNota(nota) {
-    return typeof nota === 'number' && nota >= 0 && nota <= 10;
+    return typeof nota === 'number' && nota >= 0 && true;
   }
 
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 5: Erro na entrada da Nota2 (valor acima de 10)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Erro: Nota2 inválida. Insira um número entre 0 e 10."
Received: "Resultado: Aprovado, não necessita de prova extra."

[Killed] BooleanLiteral
index.js:8:7
   }
 
   // Validação das notas de entrada
-  if (!validarNota(nota1)) {
+  if (validarNota(nota1)) {
     return 'Erro: Nota1 inválida. Insira um número entre 0 e 10.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Erro: Nota1 inválida. Insira um número entre 0 e 10."

[Killed] ConditionalExpression
index.js:8:7
   }
 
   // Validação das notas de entrada
-  if (!validarNota(nota1)) {
+  if (false) {
     return 'Erro: Nota1 inválida. Insira um número entre 0 e 10.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 4: Erro na entrada da Nota1 (valor negativo)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Erro: Nota1 inválida. Insira um número entre 0 e 10."
Received: "Resultado: Reprovado."

[Killed] StringLiteral
index.js:9:12
 
   // Validação das notas de entrada
   if (!validarNota(nota1)) {
-    return 'Erro: Nota1 inválida. Insira um número entre 0 e 10.';
+    return "";
   }
   if (!validarNota(nota2)) {
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 4: Erro na entrada da Nota1 (valor negativo)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Erro: Nota1 inválida. Insira um número entre 0 e 10."
Received: ""

[Killed] BooleanLiteral
index.js:11:7
   if (!validarNota(nota1)) {
     return 'Erro: Nota1 inválida. Insira um número entre 0 e 10.';
   }
-  if (!validarNota(nota2)) {
+  if (validarNota(nota2)) {
     return 'Erro: Nota2 inválida. Insira um número entre 0 e 10.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Erro: Nota2 inválida. Insira um número entre 0 e 10."

[Killed] BlockStatement
index.js:11:28
   if (!validarNota(nota1)) {
     return 'Erro: Nota1 inválida. Insira um número entre 0 e 10.';
   }
-  if (!validarNota(nota2)) {
-    return 'Erro: Nota2 inválida. Insira um número entre 0 e 10.';
-  }
+  if (!validarNota(nota2)) {}
 
   // Cálculo do total de pontos
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 5: Erro na entrada da Nota2 (valor acima de 10)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Erro: Nota2 inválida. Insira um número entre 0 e 10."
Received: "Resultado: Aprovado, não necessita de prova extra."

[Killed] ArithmeticOperator
index.js:16:17
   }
 
   // Cálculo do total de pontos
-  const total = nota1 + nota2;
+  const total = nota1 - nota2;
 
   // Verificação do total de pontos
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Resultado: Reprovado."

[Killed] ConditionalExpression
index.js:19:7
   const total = nota1 + nota2;
 
   // Verificação do total de pontos
-  if (total < 12) {
+  if (false) {
     return 'Resultado: Reprovado.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 3: Reprovado por não atingir 12 pontos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Reprovado."
Received: "Resultado: Necessita de prova extra."

[Killed] EqualityOperator
index.js:19:7
   const total = nota1 + nota2;
 
   // Verificação do total de pontos
-  if (total < 12) {
+  if (total >= 12) {
     return 'Resultado: Reprovado.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Resultado: Reprovado."

[Killed] EqualityOperator
index.js:24:7
   }
 
   // Verificação das notas individuais
-  if (nota1 < 6 || nota2 < 6) {
+  if (nota1 >= 6 || nota2 < 6) {
     return 'Resultado: Necessita de prova extra.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 1: Aprovado sem necessidade de prova extra
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Aprovado, não necessita de prova extra."
Received: "Resultado: Necessita de prova extra."

[Killed] ConditionalExpression
index.js:24:7
   }
 
   // Verificação das notas individuais
-  if (nota1 < 6 || nota2 < 6) {
+  if (false) {
     return 'Resultado: Necessita de prova extra.';
   }
killedBy: Teste do cálculo de resultados acadêmicos Caso de teste 2: Necessita de prova extra por ter nota abaixo de 6
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Resultado: Necessita de prova extra."
Received: "Resultado: Aprovado, não necessita de prova extra."
